In [1]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

In [3]:
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [4]:
df.loc[:10, 'salary_rate':'salary_hour_avg']

   salary_rate  salary_year_avg  salary_hour_avg
0         None              NaN              NaN
1         None              NaN              NaN
2         None              NaN              NaN
3         None              NaN              NaN
4         None              NaN              NaN
5         None              NaN              NaN
6         None              NaN              NaN
7         None              NaN              NaN
8         None              NaN              NaN
9         None              NaN              NaN
10        None              NaN              NaN

In [8]:
median_salary_year = df['salary_year_avg'].median()

In [9]:
median_salary_hour = df['salary_hour_avg'].median()

In [13]:
df_filled = df

df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [14]:
df_filled['salary_year_avg']

0         115000.0
1         115000.0
2         115000.0
3         115000.0
4         115000.0
            ...
785736    115000.0
785737    115000.0
785738    115000.0
785739    115000.0
785740    115000.0
Name: salary_year_avg, Length: 785741, dtype: float64

In [15]:
df_filled['salary_hour_avg']

0         45.98
1         45.98
2         45.98
3         45.98
4         45.98
          ...
785736    45.98
785737    45.98
785738    45.98
785739    45.98
785740    45.98
Name: salary_hour_avg, Length: 785741, dtype: float64

In [17]:
df.loc[0:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [20]:
df_unique = df_filled

df_unique = df_unique.drop_duplicates()

print('length of original df        :       ',len(df_filled))
print('length of drop duplicates df :       ',len(df_unique))
print('Rows Dropped                 :       ',len(df_filled)-len(df_unique))

length of original df        :        785741
length of drop duplicates df :        785640
Rows Dropped                 :        101

In [21]:
df_unique = df_unique.drop_duplicates(subset=['job_title', 'company_name'])

In [22]:
print('length of original df        :       ',len(df_filled))
print('length of drop duplicates df :       ',len(df_unique))
print('Rows Dropped                 :       ',len(df_filled)-len(df_unique))

length of original df        :        785741
length of drop duplicates df :        508042
Rows Dropped                 :        277699